{
  "Alice": {
    "name": "Alice",
    "age": 24,
    "gender": "female",
    "personality_traits": {
      "Openness": 18,
      "Conscientiousness": 23,
      "Extraversion": 6,
      "Agreeableness": 13,
      "Neuroticism": 5
    },
    "personality_description": "Alice’s personality is structured and order-oriented, as shown in her Big Five scores (based on the NEO-FFI-30 questionnaire, 0–24 scale): - Openness: 18 (open to ideas within a structured context) - Conscientiousness: 23 (highly organized and responsible) - Extraversion: 6 (reserved, speaks when needed) - Agreeableness: 13 (collaborative but principled) - Neuroticism: 5 (calm under pressure, emotionally stable)",
    "lifestyle_log": "I usually get up around 7 a.m. and start my day with a task list. I like knowing what's expected—whether it's chores, shopping, or when people are using the kitchen. I'm okay with sharing, but I prefer when everyone respects clear boundaries. I don’t talk a lot unless necessary, but I notice when things are out of order. In the past, I’ve had to stay up late fixing things when people forgot their share, so I’d rather remind early than scramble later. If something’s messy or late too often, I’ll bring it up—not to nag, but because it disrupts my flow.",
    "hidden_motivation": "Alice likes to keep things planned—not because she wants to control others, but because she functions better with predictability. Her schedule is tight, and last-minute changes can throw off her whole day. To her, having clear rules and routines is not about power—it’s about making shared living smoother for everyone. She assumes others appreciate structure too, but she’s slowly realizing that not everyone runs on checklists like she does.",
    "stance_on_house_rules": {
      "for": [
        "Defined quiet hours",
        "Weekly rotating task chart",
        "Clear boundaries for shared devices and groceries"
      ],
      "against": [
        "Unclear plans or vague responsibilities",
        "Messy common spaces",
        "Unpredictable noise (e.g., music, calls in the living room)"
      ]
    }
  },
  "Benji": {
    "name": "Benji",
    "age": 23,
    "gender": "male",
    "personality_traits": {
      "Openness": 22,
      "Conscientiousness": 8,
      "Extraversion": 20,
      "Agreeableness": 13,
      "Neuroticism": 12
    },
    "personality_description": "Benji’s Big Five scores (based on the NEO-FFI-30 questionnaire, 0–24 scale) reflect his expressive, spontaneous personality:\n- Openness: 22 (highly creative, thrives on new ideas and visual inspiration)\n- Conscientiousness: 8 (flexible and often disorganized, avoids rigid routines)\n- Extraversion: 20 (outgoing, talkative, and energized by social interaction)\n- Agreeableness: 13 (cooperative but values freedom and informality)\n- Neuroticism: 12 (moderately reactive, can get overwhelmed but hides it with humor or deflection)",
    "lifestyle_log": "I usually wake up late—depends on my deadlines or my mood. My creative process is a bit chaotic, so I often have drawings, materials, and sketches spread across the living room. I like turning the space into something that inspires me, even if it looks messy. I’m not big on cleaning schedules—they stress me out—but I clean when the mood hits. I love spontaneous hangouts or group dinners, though I often forget to ask first. It's not because I don't care—I just assume if it bothered someone, they'd say so. Too many rules make the space feel like a job, not a home.",
    "hidden_motivation": "Benji thrives in environments where he's free to flow between creativity and rest. Structure makes him feel boxed in, even if he knows it's necessary sometimes. He doesn’t like being told what to do or when to do it—he prefers mutual reminders over assigned roles. When he forgets something, it’s rarely about disrespect—it’s usually because he was deep in a mental project or in his own head. He believes people should give each other space to be themselves, even if it means a little mess.",
    "stance_on_house_rules": {
      "for": [
        "Creative use of space",
        "Flexible space for friends to visit",
        "A home atmosphere that is not too 'corporate' or controlling"
      ],
      "against": [
        "Strict chore chart systems",
        "Over-regulated daily routines",
        "Any policy that puts rules over people"
      ]
    }
  },
  "Caden": {
    "name": "Caden",
    "age": 24,
    "gender": "female",
    "personality_traits": {
      "Openness": 14,
      "Conscientiousness": 17,
      "Extraversion": 5,
      "Agreeableness": 23,
      "Neuroticism": 4
    },
    "personality_description": "Caden's personality is calm, empathetic, and emotionally intuitive, reflected in her Big Five scores (NEO-FFI-30, 0–24 scale): - Openness: 14 (quietly reflective, prefers harmony over novelty) - Conscientiousness: 17 (reliable and steady, though not rigid) - Extraversion: 5 (introverted and observant, prefers calm environments) - Agreeableness: 23 (deeply empathetic and conflict-avoidant) - Neuroticism: 4 (emotionally stable, avoids overreacting)",
    "lifestyle_log": "I wake up around 8 a.m. and take time to ease into the day—usually some journaling, yoga, or reading. I can sense when people are upset, even if they don’t say anything. I try to help smooth things over before it gets tense. I prefer calm, predictable environments and don’t do well with conflict. I don’t mind taking on extra chores if it helps the vibe stay peaceful—but sometimes it feels like no one notices how much I try to keep things steady in the background.",
    "hidden_motivation": "Caden doesn’t like conflict—not because she’s fragile, but because she values emotional stability. She’s the kind of person who notices tension early but prefers to wait and see if things settle on their own. Her calm and accommodating style sometimes makes people assume she’s always okay with everything. In reality, she just chooses not to make small things bigger. She’s not looking for extra attention—just mutual respect and some space to breathe without pressure. She’s not trying to avoid issues—she just believes that not every tension needs to be turned into a discussion.",
    "stance_on_house_rules": {
      "for": [
        "Emotional check-ins or “house talks”",
        "Respecting each other’s bad days",
        "Thoughtful communication around needs and feelings"
      ],
      "against": [
        "Passive-aggressiveness",
        "Ignoring emotional tension",
        "Overly rigid structure that ignores well-being"
      ]
    }
  }
}
